sanmanp2111993/CMPE/CMPE240/ExtInt/src/LPC17xx_1.h
#ifndef __LPC17xx_H
#define __LPC17xx_H

#include "CortexM3.h"


/* System Control Block (SCB) includes:
   Flash Accelerator Module, Clocking and Power Control, External Interrupts,
   Reset, System Control and Status
*/
#define I2CPADCFG   (*(volatile unsigned long *)(0x4002C07C))    
#define SCB_BASE_ADDR   0x400FC000

/* Nested Vectored Interrupt Controller (NVIC) */
#define NVIC_BASE_ADDR	0xE000E100
#define VTOR           (*(volatile unsigned long *)(0xE000ED08))
#define ISER0		   (*(volatile unsigned long *)(NVIC_BASE_ADDR + 0x000))
#define ISER1		   (*(volatile unsigned long *)(NVIC_BASE_ADDR + 0x004))
#define ICER0	       (*(volatile unsigned long *)(NVIC_BASE_ADDR + 0x080))
#define ICER1          (*(volatile unsigned long *)(NVIC_BASE_ADDR + 0x084))
#define ISPR0          (*(volatile unsigned long *)(NVIC_BASE_ADDR + 0x100))
#define ISPR1          (*(volatile unsigned long *)(NVIC_BASE_ADDR + 0x104))
#define ICPR0          (*(volatile unsigned long *)(NVIC_BASE_ADDR + 0x180))
#define ICPR1          (*(volatile unsigned long *)(NVIC_BASE_ADDR + 0x184))
#define IABR0          (*(volatile unsigned long *)(NVIC_BASE_ADDR + 0x200))
#define IABR1          (*(volatile unsigned long *)(NVIC_BASE_ADDR + 0x204))
#define IPR0           (*(volatile unsigned long *)(NVIC_BASE_ADDR + 0x300))
#define IPR1           (*(volatile unsigned long *)(NVIC_BASE_ADDR + 0x304))
#define IPR2           (*(volatile unsigned long *)(NVIC_BASE_ADDR + 0x308))
#define IPR3           (*(volatile unsigned long *)(NVIC_BASE_ADDR + 0x30C))
#define IPR4           (*(volatile unsigned long *)(NVIC_BASE_ADDR + 0x310))
#define IPR5           (*(volatile unsigned long *)(NVIC_BASE_ADDR + 0x314))
#define IPR6           (*(volatile unsigned long *)(NVIC_BASE_ADDR + 0x318))
#define IPR7           (*(volatile unsigned long *)(NVIC_BASE_ADDR + 0x31C))
#define IPR8           (*(volatile unsigned long *)(NVIC_BASE_ADDR + 0x320))
#define IPR9           (*(volatile unsigned long *)(NVIC_BASE_ADDR + 0x324))
#define IPR10          (*(volatile unsigned long *)(NVIC_BASE_ADDR + 0x328))
#define STIR           (*(volatile unsigned long *)(0xE000 EF00))

/* Flash Accelerator Module */
#define FLASHCTRL      (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x000))
#define FLASHTIM       (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x004))

/* Phase Locked Loop (Main PLL0) */
#define PLL0CON        (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x080))
#define PLL0CFG        (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x084))
#define PLL0STAT       (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x088))
#define PLL0FEED       (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x08C))

/* Phase Locked Loop (USB PLL1) */
#define PLL1CON        (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x0A0))
#define PLL1CFG        (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x0A4))
#define PLL1STAT       (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x0A8))
#define PLL1FEED       (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x0AC))

/* Power Control */
#define PCON           (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x0C0))
#define PCONP          (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x0C4))

/* Clock Selection and Dividers */
#define CCLKCFG        (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x104))
#define USBCLKCFG      (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x108))
#define CLKSRCSEL      (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x10C))
#define IRCTRIM        (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x1A4))
#define PCLKSEL0       (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x1A8))
#define PCLKSEL1       (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x1AC))
    
/* External Interrupts */
#define EXTINT         (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x140))
#define EXTMODE        (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x148))
#define EXTPOLAR       (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x14C))

/* Reset */
#define RSIR           (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x180))

/* System Controls and Status */
#define SCS            (*(volatile unsigned long *)(SCB_BASE_ADDR + 0x1A0)) 

/* PIN Connect Block(IOCON) */
#define IOCON_P0_BASE_ADDR	0x4002C000
#define IOCON_P0_0       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x000))
#define IOCON_P0_1       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x004))
#define IOCON_P0_2       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x008))
#define IOCON_P0_3       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x00C))
#define IOCON_P0_4       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x010))
#define IOCON_P0_5       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x014))
#define IOCON_P0_6       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x018))
#define IOCON_P0_7       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x01C))
#define IOCON_P0_8       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x020))
#define IOCON_P0_9       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x024))
#define IOCON_P0_10      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x028))
#define IOCON_P0_11      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x02C))
#define IOCON_P0_12      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x030))
#define IOCON_P0_13      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x034))
#define IOCON_P0_14      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x038))
#define IOCON_P0_15      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x03C))
#define IOCON_P0_16      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x040))
#define IOCON_P0_17      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x044))
#define IOCON_P0_18      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x048))
#define IOCON_P0_19      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x04C))
#define IOCON_P0_20      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x050))
#define IOCON_P0_21      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x054))
#define IOCON_P0_22      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x058))
#define IOCON_P0_23      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x05C))
#define IOCON_P0_24      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x060))
#define IOCON_P0_25      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x064))
#define IOCON_P0_26      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x068))
#define IOCON_P0_27      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x06C))
#define IOCON_P0_28      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x070))
#define IOCON_P0_29      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x074))
#define IOCON_P0_30      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x078))
#define IOCON_P0_31      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x07C))

