sanmanp2111993/CMPE/CMPE240/ExtInt/src/LPC17xx_1.h
#define IOCON_P1_0       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x080))
#define IOCON_P1_1       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x084))
#define IOCON_P1_2       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x088))
#define IOCON_P1_3       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x08C))
#define IOCON_P1_4       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x090))
#define IOCON_P1_5       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x094))
#define IOCON_P1_6       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x098))
#define IOCON_P1_7       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x09C))
#define IOCON_P1_8       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x0A0))
#define IOCON_P1_9       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x0A4))
#define IOCON_P1_10      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x0A8))
#define IOCON_P1_11      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x0AC))
#define IOCON_P1_12      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x0B0))
#define IOCON_P1_13      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x0B4))
#define IOCON_P1_14      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x0B8))
#define IOCON_P1_15      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x0BC))
#define IOCON_P1_16      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x0C0))
#define IOCON_P1_17      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x0C4))
#define IOCON_P1_18      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x0C8))
#define IOCON_P1_19      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x0CC))
#define IOCON_P1_20      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x0D0))
#define IOCON_P1_21      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x0D4))
#define IOCON_P1_22      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x0D8))
#define IOCON_P1_23      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x0DC))
#define IOCON_P1_24      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x0E0))
#define IOCON_P1_25      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x0E4))
#define IOCON_P1_26      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x0E8))
#define IOCON_P1_27      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x0EC))
#define IOCON_P1_28      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x0F0))
#define IOCON_P1_29      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x0F4))
#define IOCON_P1_30      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x0F8))
#define IOCON_P1_31      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x0FC))

#define IOCON_P2_0       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x100))
#define IOCON_P2_1       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x104))
#define IOCON_P2_2       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x108))
#define IOCON_P2_3       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x10C))
#define IOCON_P2_4       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x110))
#define IOCON_P2_5       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x114))
#define IOCON_P2_6       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x118))
#define IOCON_P2_7       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x11C))
#define IOCON_P2_8       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x120))
#define IOCON_P2_9       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x124))
#define IOCON_P2_10      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x128))
#define IOCON_P2_11      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x12C))
#define IOCON_P2_12      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x130))
#define IOCON_P2_13      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x134))
#define IOCON_P2_14      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x138))
#define IOCON_P2_15      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x13C))
#define IOCON_P2_16      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x140))
#define IOCON_P2_17      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x144))
#define IOCON_P2_18      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x148))
#define IOCON_P2_19      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x14C))
#define IOCON_P2_20      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x150))
#define IOCON_P2_21      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x154))
#define IOCON_P2_22      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x158))
#define IOCON_P2_23      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x15C))
#define IOCON_P2_24      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x160))
#define IOCON_P2_25      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x164))
#define IOCON_P2_26      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x168))
#define IOCON_P2_27      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x16C))
#define IOCON_P2_28      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x170))
#define IOCON_P2_29      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x174))
#define IOCON_P2_30      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x178))
#define IOCON_P2_31      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x17C))

#define IOCON_P3_0       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x180))
#define IOCON_P3_1       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x184))
#define IOCON_P3_2       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x188))
#define IOCON_P3_3       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x18C))
#define IOCON_P3_4       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x190))
#define IOCON_P3_5       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x194))
#define IOCON_P3_6       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x198))
#define IOCON_P3_7       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x19C))
#define IOCON_P3_8       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x1A0))
#define IOCON_P3_9       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x1A4))
#define IOCON_P3_10      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x1A8))
#define IOCON_P3_11      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x1AC))
#define IOCON_P3_12      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x1B0))
#define IOCON_P3_13      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x1B4))
#define IOCON_P3_14      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x1B8))
#define IOCON_P3_15      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x1BC))
#define IOCON_P3_16      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x1C0))
#define IOCON_P3_17      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x1C4))
#define IOCON_P3_18      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x1C8))
#define IOCON_P3_19      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x1CC))
#define IOCON_P3_20      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x1D0))
#define IOCON_P3_21      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x1D4))
#define IOCON_P3_22      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x1D8))
#define IOCON_P3_23      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x1DC))
#define IOCON_P3_24      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x1E0))
#define IOCON_P3_25      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x1E4))
#define IOCON_P3_26      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x1E8))
#define IOCON_P3_27      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x1EC))
#define IOCON_P3_28      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x1F0))
#define IOCON_P3_29      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x1F4))
#define IOCON_P3_30      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x1F8))
#define IOCON_P3_31      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x1FC))

