sanmanp2111993/CMPE/CMPE240/ExtInt/src/LPC17xx_1.h
#define IOCON_P4_0       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x200))
#define IOCON_P4_1       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x204))
#define IOCON_P4_2       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x208))
#define IOCON_P4_3       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x20C))
#define IOCON_P4_4       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x210))
#define IOCON_P4_5       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x214))
#define IOCON_P4_6       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x218))
#define IOCON_P4_7       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x21C))
#define IOCON_P4_8       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x220))
#define IOCON_P4_9       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x224))
#define IOCON_P4_10      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x228))
#define IOCON_P4_11      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x22C))
#define IOCON_P4_12      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x230))
#define IOCON_P4_13      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x234))
#define IOCON_P4_14      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x238))
#define IOCON_P4_15      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x23C))
#define IOCON_P4_16      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x240))
#define IOCON_P4_17      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x244))
#define IOCON_P4_18      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x248))
#define IOCON_P4_19      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x24C))
#define IOCON_P4_20      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x250))
#define IOCON_P4_21      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x254))
#define IOCON_P4_22      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x258))
#define IOCON_P4_23      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x25C))
#define IOCON_P4_24      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x260))
#define IOCON_P4_25      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x264))
#define IOCON_P4_26      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x268))
#define IOCON_P4_27      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x26C))
#define IOCON_P4_28      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x270))
#define IOCON_P4_29      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x274))
#define IOCON_P4_30      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x278))
#define IOCON_P4_31      (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x27C))

#define IOCON_P5_0       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x280))
#define IOCON_P5_1       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x284))
#define IOCON_P5_2       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x288))
#define IOCON_P5_3       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x28C))
#define IOCON_P5_4       (*(volatile unsigned long *)(IOCON_P0_BASE_ADDR + 0x290))

/* Pin Connect Block */
#define PINCON_BASE_ADDR 0x4002C000
#define PINSEL0        (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x00))
#define PINSEL1        (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x04))
#define PINSEL2        (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x08))
#define PINSEL3        (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x0C))
#define PINSEL4        (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x10))
#define PINSEL5        (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x14))
#define PINSEL6        (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x18))
#define PINSEL7        (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x1C))
#define PINSEL8        (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x20))
#define PINSEL9        (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x24))
#define PINSEL10       (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x28))

#define PINMODE0       (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x40))
#define PINMODE1       (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x44))
#define PINMODE2       (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x48))
#define PINMODE3       (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x4C))
#define PINMODE4       (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x50))
#define PINMODE5       (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x54))
#define PINMODE6       (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x58))
#define PINMODE7       (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x5C))
#define PINMODE8       (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x60))
#define PINMODE9       (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x64))
#define PINMODE_OD0    (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x68))
#define PINMODE_OD1    (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x6C))
#define PINMODE_OD2    (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x70))
#define PINMODE_OD3    (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x74))
#define PINMODE_OD4    (*(volatile unsigned long *)(PINCON_BASE_ADDR + 0x78))


/* General Purpose Input/Output (GPIO) - Fast GPIO */
#define GPIO_BASE_ADDR  0x2009C000		/* For silicon v0.01 or newer */
#define FIO0DIR        (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x00)) 
#define FIO0MASK       (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x10))
#define FIO0PIN        (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x14))
#define FIO0SET        (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x18))
#define FIO0CLR        (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x1C))

#define FIO1DIR        (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x20)) 
#define FIO1MASK       (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x30))
#define FIO1PIN        (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x34))
#define FIO1SET        (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x38))
#define FIO1CLR        (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x3C))

#define FIO2DIR        (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x40)) 
#define FIO2MASK       (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x50))
#define FIO2PIN        (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x54))
#define FIO2SET        (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x58))
#define FIO2CLR        (*(volatile unsigned long *)(GPIO_BASE_ADDR + 0x5C))

